return {
  "folke/snacks.nvim",
  priority = 1000,
  lazy = false,
  opts = {
    image = { enabled = true },
    lazygit = { enabled = true },
    bigfile = { enabled = true },
    quickfile = { enabled = true },
    dashboard = {
      enabled = true,
      width = 100,
      pane_gap = 4,
      preset = {
        header = [[
                               ██▒   █▓ ██▓ ███▄ ▄███▓
 ██▄████▄   ▄████▄    ▄████▄  ▓██░   █▒▓██▒▓██▒▀█▀ ██▒
 ██▀   ██  ██▄▄▄▄██  ██▀  ▀██  ▓██  █▒░▒██▒▓██    ▓██░
 ██    ██  ██▀▀▀▀▀▀  ██    ██   ▒██ █░░░██░▒██    ▒██
 ██    ██  ▀██▄▄▄▄█  ▀██▄▄██▀    ▒▀█░  ░██░▒██▒   ░██▒
 ▀▀    ▀▀    ▀▀▀▀▀     ▀▀▀▀      ░ ▐░  ░▓  ░ ▒░   ░  ░
                                 ░ ░░   ▒ ░░  ░      ░
                                   ░░   ▒ ░░      ░
                                    ░   ░         ░
                                   ░
        ]]
      },
    },
  },
  keys = {
    { "<leader>lg", function() require("snacks").lazygit() end, desc = "Lazygit" },
  }
}
